# 1.Зашифровать текст по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ, как минимум, одним из шифров перестановки - Блок D: ШИФРЫ ПЕРЕСТАНОВКИ* :

# 10.Вертикальная перестановка
# 11.Решетка Кардано
# 12. Перестановка в комбинационных шифрах (DES, ГОСТ 28147-89, МАГМА) - сеть Фейстеля
# 2. Написать программу для выбранных шифров перестановки (отладка и тестирование программы по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ), при этом предусмотреть ввод ключевых параметров и их проверку.

# 3. Проверить работу программы на тексте не менее 1000 символов.

# 4. Подготовить отчет в соответствие с требованиями  Методических указаний*.
# https://lms.mospolytech.ru/mod/assign/view.php?id=227056


