# 1.Зашифровать текст по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ, как минимум, одним из шифров гаммирования - Блок E: ШИФРЫ ГАММИРОВАНИЯ* :

# 13.Одноразовый блокнот К.Шеннона
# 14.Гаммирование ГОСТ 28147-89 или ГОСТ Р 34.13-2015 (МАГМА)



# 2. Написать программу для выбранных шифров гаммирования (отладка и тестирование программы по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ и ГОСТ Р 34.13-2015).

# 3. Проверить работу программы на тексте не менее 1000 символов.

# 4. Подготовить отчет в соответствие с требованиями  Методических указаний*.

# 5. Загрузить результаты работы в файлах в текущее задание LMS (без архивирования!)
# https://lms.mospolytech.ru/mod/assign/view.php?id=227062


