"""Лабораторная работа 10.Программирование алгоритмов ГОСТ Р 34.10

1. Сгенерировать цифровую подпись под текстом по вариантам по одному из алгоритмов цифровой подписи  - Блок J: СТАНДАРТЫ ЦИФРОВЫХ ПОДПИСЕЙ*:
26. ГОСТ Р 34.10-94
27. ГОСТ Р 34.10-2012***

2. Написать программу для одного из алгоритмов цифровой подписи (отладка и тестирование программы по своему варианту** из  файла ВАРИАНТЫ ЗАДАНИЙ).

3. Проверить работу программы на тексте не менее 1000 символов**.

4. Подготовить отчет в соответствие с требованиями  Методических указаний*.
https://online.mospolytech.ru/mod/assign/view.php?id=227074
"""

