"""Лабораторная работа 9. Генерация цифровой подписи

1. Сгенерировать цифровую подпись под текстом по вариантам, как минимум, по одному из алгоритмов цифровой подписи  - Блок I: АЛГОРИТМЫ ЦИФРОВЫХ ПОДПИСЕЙ*:

24. RSA
25. Elgamal

2. Написать программу для выбранных алгоритмов цифровой подписи (отладка и тестирование программы по своему варианту** из  файла ВАРИАНТЫ ЗАДАНИЙ).

3. Проверить работу программы на тексте не менее 1000 символов**.

4. Подготовить отчет в соответствие с требованиями  Методических указаний*.

https://online.mospolytech.ru/mod/assign/view.php?id=227073
"""