"""Лабораторная работа 6. Поточные шифры

1.Зашифровать текст по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ, как минимум, одним из поточных шифров: Блок F: ПОТОЧНЫЕ ШИФРЫ* :

15. А5 /1 или Учебная модель А5**

16. А5 /2

2. Написать программу для выбранных поточных шифров  (отладка и тестирование программы по результату шифрования первых трех букв своего варианта из  файла ВАРИАНТЫ ЗАДАНИЙ).

3. Проверить работу программы на тексте не менее 1000 символов.

4. Подготовить отчет в соответствие с требованиями  Методических указаний*.

* Методические указания - файл ЛАБКРИПТ_2022

**Учебная модель А5 в файле Учебный алгоритм А5
https://online.mospolytech.ru/mod/assign/view.php?id=227068"""