"""Лабораторная работа 7. КОМБИНАЦИОННЫЕ ШИФРЫ

1.Написать программу, как минимум, для одного из комбинационных шифров (отладка и тестирование программ по примерам из ГОСТ Р 34.12-2015, ГОСТ Р 34.13-2015 и AES) - Блок G: КОМБИНАЦИОННЫЕ ШИФРЫ* :

17. МАГМА**
18. ГОСТ 28147-89 - (отладка и тестирование программы по результату шифрования своего варианта из файла ВАРИАНТЫ ЗАДАНИЙ шифром S-блок замены ГОСТ Р 34.12-2015 («МАГМА») )
19. AES***
20. КУЗНЕЧИК**

3. Проверить работу программы на тексте не менее 1000 символов.

4. Подготовить отчет в соответствие с требованиями  Методических указаний*.

* Методические указания - файл ЛАБКРИПТ_2022
** ГОСТ Р 34.12-2015, ГОСТ Р 34.13-2015, файл Кузнечик (числовые примеры - https://habr.com/ru/post/459004/ и https://xakep.ru/2017/02/02/working-with-grasshopper/)                           
      Магма (числовой пример - https://xakep.ru/2018/05/10/working-with-magma/)
***  Проверка по документации FIPS-197 (https://csrc.nist.gov/csrc/media/publications/fips/197/final/documents/fips-197.pdf). 
https://online.mospolytech.ru/mod/assign/view.php?id=227070"""