"""Лабораторная работа 8. Асимметричные шифры

1. Зашифровать текст по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ, как минимум, одним из асимметричных шифров - Блок H: АСИММЕТРИЧНЫЕ ШИФРЫ* :

 21. RSA

 22. Elgamal

 23. ECC – С ИСПОЛЬЗОВАНИЕМ АБСЦИССЫ ТОЧКИ**

2. Написать программу для одного из асимметричных шифров (отладка и тестирование программы по своему варианту из  файла ВАРИАНТЫ ЗАДАНИЙ***).

3. Проверить работу программы на тексте не менее 1000 символов.

4. Подготовить отчет в соответствие с требованиями  Методических указаний*.
https://online.mospolytech.ru/mod/assign/view.php?id=227072"""

